reports/local[2]_1ser_400tunn_5inst_500user_1m.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 500 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 500 VUs  0m00.9s/1m0s

running (0m01.9s), 500/500 VUs, 21 complete and 0 interrupted iterations
default   [   3% ] 500 VUs  0m01.9s/1m0s

running (0m02.9s), 500/500 VUs, 438 complete and 0 interrupted iterations
default   [   5% ] 500 VUs  0m02.9s/1m0s

running (0m03.9s), 500/500 VUs, 485 complete and 0 interrupted iterations
default   [   7% ] 500 VUs  0m03.9s/1m0s

running (0m04.9s), 500/500 VUs, 699 complete and 0 interrupted iterations
default   [   8% ] 500 VUs  0m04.9s/1m0s

running (0m05.9s), 500/500 VUs, 782 complete and 0 interrupted iterations
default   [  10% ] 500 VUs  0m05.9s/1m0s

running (0m06.9s), 500/500 VUs, 826 complete and 0 interrupted iterations
default   [  12% ] 500 VUs  0m06.9s/1m0s

running (0m07.9s), 500/500 VUs, 862 complete and 0 interrupted iterations
default   [  13% ] 500 VUs  0m07.9s/1m0s

running (0m08.9s), 500/500 VUs, 916 complete and 0 interrupted iterations
default   [  15% ] 500 VUs  0m08.9s/1m0s

running (0m09.9s), 500/500 VUs, 1284 complete and 0 interrupted iterations
default   [  17% ] 500 VUs  0m09.9s/1m0s

running (0m10.9s), 500/500 VUs, 1502 complete and 0 interrupted iterations
default   [  18% ] 500 VUs  0m10.9s/1m0s

running (0m11.9s), 500/500 VUs, 1668 complete and 0 interrupted iterations
default   [  20% ] 500 VUs  0m11.9s/1m0s

running (0m12.9s), 500/500 VUs, 1982 complete and 0 interrupted iterations
default   [  22% ] 500 VUs  0m12.9s/1m0s

running (0m13.9s), 500/500 VUs, 2050 complete and 0 interrupted iterations
default   [  23% ] 500 VUs  0m13.9s/1m0s

running (0m14.9s), 500/500 VUs, 2234 complete and 0 interrupted iterations
default   [  25% ] 500 VUs  0m14.9s/1m0s

running (0m15.9s), 500/500 VUs, 2502 complete and 0 interrupted iterations
default   [  27% ] 500 VUs  0m15.9s/1m0s

running (0m16.9s), 500/500 VUs, 2557 complete and 0 interrupted iterations
default   [  28% ] 500 VUs  0m16.9s/1m0s

running (0m17.9s), 500/500 VUs, 2736 complete and 0 interrupted iterations
default   [  30% ] 500 VUs  0m17.9s/1m0s

running (0m18.9s), 500/500 VUs, 2942 complete and 0 interrupted iterations
default   [  32% ] 500 VUs  0m18.9s/1m0s

running (0m19.9s), 500/500 VUs, 3066 complete and 0 interrupted iterations
default   [  33% ] 500 VUs  0m19.9s/1m0s

running (0m20.9s), 500/500 VUs, 3368 complete and 0 interrupted iterations
default   [  35% ] 500 VUs  0m20.9s/1m0s

running (0m21.9s), 500/500 VUs, 3376 complete and 0 interrupted iterations
default   [  37% ] 500 VUs  0m21.9s/1m0s

running (0m22.9s), 500/500 VUs, 3510 complete and 0 interrupted iterations
default   [  38% ] 500 VUs  0m22.9s/1m0s

running (0m23.9s), 500/500 VUs, 3809 complete and 0 interrupted iterations
default   [  40% ] 500 VUs  0m23.9s/1m0s

running (0m24.9s), 500/500 VUs, 3813 complete and 0 interrupted iterations
default   [  42% ] 500 VUs  0m24.9s/1m0s

running (0m25.9s), 500/500 VUs, 3853 complete and 0 interrupted iterations
default   [  43% ] 500 VUs  0m25.9s/1m0s

running (0m26.9s), 500/500 VUs, 4120 complete and 0 interrupted iterations
default   [  45% ] 500 VUs  0m26.9s/1m0s

running (0m27.9s), 500/500 VUs, 4187 complete and 0 interrupted iterations
default   [  47% ] 500 VUs  0m27.9s/1m0s

running (0m28.9s), 500/500 VUs, 4207 complete and 0 interrupted iterations
default   [  48% ] 500 VUs  0m28.9s/1m0s

running (0m29.9s), 500/500 VUs, 4543 complete and 0 interrupted iterations
default   [  50% ] 500 VUs  0m29.9s/1m0s

running (0m30.9s), 500/500 VUs, 4612 complete and 0 interrupted iterations
default   [  52% ] 500 VUs  0m30.9s/1m0s

running (0m31.9s), 500/500 VUs, 4653 complete and 0 interrupted iterations
default   [  53% ] 500 VUs  0m31.9s/1m0s

running (0m32.9s), 500/500 VUs, 4960 complete and 0 interrupted iterations
default   [  55% ] 500 VUs  0m32.9s/1m0s

running (0m33.9s), 500/500 VUs, 4981 complete and 0 interrupted iterations
default   [  57% ] 500 VUs  0m33.9s/1m0s

running (0m34.9s), 500/500 VUs, 4981 complete and 0 interrupted iterations
default   [  58% ] 500 VUs  0m34.9s/1m0s

running (0m35.9s), 500/500 VUs, 5007 complete and 0 interrupted iterations
default   [  60% ] 500 VUs  0m35.9s/1m0s

running (0m36.9s), 500/500 VUs, 5127 complete and 0 interrupted iterations
default   [  62% ] 500 VUs  0m36.9s/1m0s

running (0m37.9s), 500/500 VUs, 5352 complete and 0 interrupted iterations
default   [  63% ] 500 VUs  0m37.9s/1m0s

running (0m38.9s), 500/500 VUs, 5417 complete and 0 interrupted iterations
default   [  65% ] 500 VUs  0m38.9s/1m0s

running (0m39.9s), 500/500 VUs, 5419 complete and 0 interrupted iterations
default   [  67% ] 500 VUs  0m39.9s/1m0s

running (0m40.9s), 500/500 VUs, 5466 complete and 0 interrupted iterations
default   [  68% ] 500 VUs  0m40.9s/1m0s

running (0m41.9s), 500/500 VUs, 5739 complete and 0 interrupted iterations
default   [  70% ] 500 VUs  0m41.9s/1m0s

running (0m42.9s), 500/500 VUs, 5759 complete and 0 interrupted iterations
default   [  72% ] 500 VUs  0m42.9s/1m0s

running (0m43.9s), 500/500 VUs, 5793 complete and 0 interrupted iterations
default   [  73% ] 500 VUs  0m43.9s/1m0s

running (0m44.9s), 500/500 VUs, 6023 complete and 0 interrupted iterations
default   [  75% ] 500 VUs  0m44.9s/1m0s

running (0m45.9s), 500/500 VUs, 6048 complete and 0 interrupted iterations
default   [  77% ] 500 VUs  0m45.9s/1m0s

running (0m46.9s), 500/500 VUs, 6083 complete and 0 interrupted iterations
default   [  78% ] 500 VUs  0m46.9s/1m0s

running (0m47.9s), 500/500 VUs, 6374 complete and 0 interrupted iterations
default   [  80% ] 500 VUs  0m47.9s/1m0s

running (0m48.9s), 500/500 VUs, 6449 complete and 0 interrupted iterations
default   [  82% ] 500 VUs  0m48.9s/1m0s

running (0m49.9s), 500/500 VUs, 6467 complete and 0 interrupted iterations
default   [  83% ] 500 VUs  0m49.9s/1m0s

running (0m50.9s), 500/500 VUs, 6492 complete and 0 interrupted iterations
default   [  85% ] 500 VUs  0m50.9s/1m0s

running (0m51.9s), 500/500 VUs, 6535 complete and 0 interrupted iterations
default   [  87% ] 500 VUs  0m51.9s/1m0s

running (0m52.9s), 500/500 VUs, 6788 complete and 0 interrupted iterations
default   [  88% ] 500 VUs  0m52.9s/1m0s

running (0m53.9s), 500/500 VUs, 6813 complete and 0 interrupted iterations
default   [  90% ] 500 VUs  0m53.9s/1m0s

running (0m54.9s), 500/500 VUs, 6838 complete and 0 interrupted iterations
default   [  92% ] 500 VUs  0m54.9s/1m0s

running (0m55.9s), 500/500 VUs, 7100 complete and 0 interrupted iterations
default   [  93% ] 500 VUs  0m55.9s/1m0s

running (0m56.9s), 500/500 VUs, 7113 complete and 0 interrupted iterations
default   [  95% ] 500 VUs  0m56.9s/1m0s

running (0m57.9s), 500/500 VUs, 7142 complete and 0 interrupted iterations
default   [  97% ] 500 VUs  0m57.9s/1m0s

running (0m58.9s), 500/500 VUs, 7432 complete and 0 interrupted iterations
default   [  98% ] 500 VUs  0m58.9s/1m0s

running (0m59.9s), 500/500 VUs, 7463 complete and 0 interrupted iterations
default   [ 100% ] 500 VUs  0m59.9s/1m0s

running (1m00.9s), 496/500 VUs, 7467 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m01.9s), 456/500 VUs, 7507 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m02.9s), 316/500 VUs, 7647 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m03.9s), 149/500 VUs, 7814 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m04.9s), 128/500 VUs, 7835 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m05.9s), 099/500 VUs, 7864 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m06.9s), 099/500 VUs, 7864 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m07.9s), 099/500 VUs, 7864 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m08.9s), 079/500 VUs, 7884 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m09.9s), 005/500 VUs, 7958 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m10.9s), 004/500 VUs, 7959 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m11.9s), 004/500 VUs, 7959 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  1m0s

running (1m12.0s), 000/500 VUs, 7963 complete and 0 interrupted iterations
default ✓ [ 100% ] 500 VUs  1m0s

     ✗ status is 200
      ↳  96% — ✓ 7708 / ✗ 255

     checks.........................: 96.79% ✓ 7708       ✗ 255
     data_received..................: 43 MB  592 kB/s
     data_sent......................: 5.3 MB 74 kB/s
     http_req_blocked...............: avg=1.94s    min=0s       med=1.39s    max=25.57s  p(90)=4.49s    p(95)=7.43s
     http_req_connecting............: avg=790.88ms min=0s       med=462.56ms max=3.57s   p(90)=1.63s    p(95)=1.87s
     http_req_duration..............: avg=1.01s    min=0s       med=360.24ms max=20.23s  p(90)=2.06s    p(95)=3.6s
      { expected_response:true }...: avg=736.48ms min=244.04ms med=355.23ms max=13.92s  p(90)=1.43s    p(95)=2.43s
     http_req_failed................: 3.20%  ✓ 255        ✗ 7708
     http_req_receiving.............: avg=4.1ms    min=0s       med=63.25µs  max=1.15s   p(90)=636.82µs p(95)=1.35ms
     http_req_sending...............: avg=277.08µs min=0s       med=116.67µs max=67.64ms p(90)=337.91µs p(95)=461.97µs
     http_req_tls_handshaking.......: avg=903.09ms min=0s       med=290.6ms  max=23.92s  p(90)=1.29s    p(95)=5.41s
     http_req_waiting...............: avg=1.01s    min=0s       med=358.79ms max=20.23s  p(90)=1.99s    p(95)=3.6s
     http_reqs......................: 7963   110.669105/s
     iteration_duration.............: avg=4.02s    min=1.24s    med=3.04s    max=26.83s  p(90)=7.34s    p(95)=12.61s
     iterations.....................: 7963   110.669105/s
     vus............................: 4      min=4        max=500
     vus_max........................: 500    min=500      max=500